; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v6)
		(pred_2 ?v1)
		(pred_5 ?v4)
		(pred_1 ?v4)
		(pred_4 ?v1 ?v4)
		(pred_3)
		(pred_6 ?v1))

   (:action op_1
       :parameters  (?v5 ?v8)
       :precondition (and (not-eq ?v5 ?v8) 
                          (pred_5 ?v5) (pred_5 ?v8) (pred_1 ?v5))
       :effect (and  (pred_1 ?v8)
		     (not (pred_1 ?v5))))


   (:action op_2
       :parameters (?v3 ?v2)
       :precondition  (and  (pred_2 ?v3) (pred_5 ?v2)
			    (pred_4 ?v3 ?v2) (pred_1 ?v2) (pred_3))
       :effect (and (pred_6 ?v3)
		    (not (pred_4 ?v3 ?v2)) 
		    (not (pred_3))))

   (:action op_3
       :parameters  (?v3  ?v2)
       :precondition  (and  (pred_2 ?v3) (pred_5 ?v2)
			    (pred_6 ?v3) (pred_1 ?v2))
       :effect (and (pred_4 ?v3 ?v2)
		    (pred_3)
		    (not (pred_6 ?v3)))))

; problem
(define (problem ferry-l5-c2)
(:domain ferry)
(:objects obj_06 obj_07 obj_04 obj_05 obj_01 
          obj_03 obj_02 
)
(:init
(pred_5 obj_06)
(pred_5 obj_07)
(pred_5 obj_04)
(pred_5 obj_05)
(pred_5 obj_01)
(pred_2 obj_03)
(pred_2 obj_02)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_05)
(pred_3)
(pred_4 obj_03 obj_01)
(pred_4 obj_02 obj_05)
(pred_1 obj_06)
)
(:goal
(and
(pred_4 obj_03 obj_01)
(pred_4 obj_02 obj_01)
)
)

(:constraints
  (sometime-before  (pred_4 obj_02 obj_01) (pred_1 obj_07))
)
)

; plan
1. (op_1 obj_06 obj_01)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_01)
   goals met: 1 of 2
2. (op_2 obj_03 obj_01)
   deleted: (pred_4 obj_03 obj_01) (pred_3)
   added: (pred_6 obj_03)
   goals met: 0 of 2
3. (op_1 obj_01 obj_07)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_07)
   goals met: 0 of 2
4. (op_3 obj_03 obj_07)
   deleted: (pred_6 obj_03)
   added: (pred_4 obj_03 obj_07) (pred_3)
   goals met: 0 of 2
5. (op_1 obj_07 obj_05)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_05)
   goals met: 0 of 2
6. (op_2 obj_02 obj_05)
   deleted: (pred_4 obj_02 obj_05) (pred_3)
   added: (pred_6 obj_02)
   goals met: 0 of 2
7. (op_1 obj_05 obj_01)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_01)
   goals met: 0 of 2
8. (op_3 obj_02 obj_01)
   deleted: (pred_6 obj_02)
   added: (pred_4 obj_02 obj_01) (pred_3)
   goals met: 1 of 2
9. (op_1 obj_01 obj_07)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_07)
   goals met: 1 of 2
10. (op_2 obj_03 obj_07)
   deleted: (pred_4 obj_03 obj_07) (pred_3)
   added: (pred_6 obj_03)
   goals met: 1 of 2
11. (op_1 obj_07 obj_01)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_01)
   goals met: 1 of 2
12. (op_3 obj_03 obj_01)
   deleted: (pred_6 obj_03)
   added: (pred_4 obj_03 obj_01) (pred_3)
   goals met: 2 of 2
